Autodesk.Revit.DB.BoundingBoxContainsPointFilter.Point
The XYZ point to use when matching element bounding boxes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Double,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
while specifying the tolerance to be used in deciding if the point matches the criteria.
This constructor includes the option to invert the filter and match all elements with a bounding box that do not contain the given point.
point:
The point used to find elements with a bounding box containing it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
inverted:
True if the filter should be inverted and match all elements with a bounding box that do not contain the given point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Double)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
while specifying the tolerance to be used in deciding if the point matches the criteria.
point:
The point used to find elements with a bounding box that contains it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
with the option to invert the filter and match all elements with a bounding box that do not contain the given point.
point:
The point used to find elements with a bounding box containing it.
inverted:
True if the filter should be inverted and match all elements with a bounding box that do not contain the given point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point.
point:
The point used to find elements with a bounding box that contains it.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011